ahtn/keyplus/ports/efm8/efm8/mcu/EFM8SB2/inc/SI_EFM8SB2_Register_Enums.h
#define CMP1CN0_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag                       
#define CMP1CN0_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag                       
#define CMP1CN0_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this 
                                                 ///< flag was last cleared.                            
#define CMP1CN0_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.              
                                                                                                        
#define CMP1CN0_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CMP1CN0_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CMP1CN0_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.                           
#define CMP1CN0_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.                           
                                                                                                        
#define CMP1CN0_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CMP1CN0_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CMP1CN0_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CMP1CN0_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                        
//------------------------------------------------------------------------------
// CMP1MD Enums (Comparator 1 Mode @ 0x9C)
//------------------------------------------------------------------------------
#define CMP1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CMP1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CMP1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CMP1MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CMP1MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CMP1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CMP1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CMP1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CMP1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CMP1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CMP1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CMP1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CMP1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CMP1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
//------------------------------------------------------------------------------
// CMP1MX Enums (Comparator 1 Multiplexer Selection @ 0x9E)
//------------------------------------------------------------------------------
#define CMP1MX_CMXP__FMASK      0x0F ///< Comparator Positive Input MUX Selection
#define CMP1MX_CMXP__SHIFT      0x00 ///< Comparator Positive Input MUX Selection
#define CMP1MX_CMXP__CMP1P0     0x00 ///< External pin CMP1P.0.                  
#define CMP1MX_CMXP__CMP1P1     0x01 ///< External pin CMP1P.1.                  
#define CMP1MX_CMXP__CMP1P2     0x02 ///< External pin CMP1P.2.                  
#define CMP1MX_CMXP__CMP1P3     0x03 ///< External pin CMP1P.3.                  
#define CMP1MX_CMXP__CMP1P4     0x04 ///< External pin CMP1P.4.                  
#define CMP1MX_CMXP__CMP1P5     0x05 ///< External pin CMP1P.5.                  
#define CMP1MX_CMXP__CMP1P6     0x06 ///< External pin CMP1P.6.                  
#define CMP1MX_CMXP__CMP1P7     0x07 ///< External pin CMP1P.7.                  
#define CMP1MX_CMXP__CMP1P8     0x08 ///< External pin CMP1P.8.                  
#define CMP1MX_CMXP__CMP1P9     0x09 ///< External pin CMP1P.9.                  
#define CMP1MX_CMXP__CMP1P10    0x0A ///< External pin CMP1P.10.                 
#define CMP1MX_CMXP__CMP1P11    0x0B ///< External pin CMP1P.11.                 
#define CMP1MX_CMXP__CS_COMPARE 0x0C ///< Capacitive Sense Compare.              
#define CMP1MX_CMXP__VDD_DIV_2  0x0D ///< VDD divided by 2.                      
#define CMP1MX_CMXP__VDD        0x0E ///< VDD Supply Voltage.                    
#define CMP1MX_CMXP__VDD2       0x0F ///< VDD Supply Voltage.                    
                                                                                 
#define CMP1MX_CMXN__FMASK      0xF0 ///< Comparator Negative Input MUX Selection
#define CMP1MX_CMXN__SHIFT      0x04 ///< Comparator Negative Input MUX Selection
#define CMP1MX_CMXN__CMP1N0     0x00 ///< External pin CMP1N.0.                  
#define CMP1MX_CMXN__CMP1N1     0x10 ///< External pin CMP1N.1.                  
#define CMP1MX_CMXN__CMP1N2     0x20 ///< External pin CMP1N.2.                  
#define CMP1MX_CMXN__CMP1N3     0x30 ///< External pin CMP1N.3.                  
#define CMP1MX_CMXN__CMP1N4     0x40 ///< External pin CMP1N.4.                  
#define CMP1MX_CMXN__CMP1N5     0x50 ///< External pin CMP1N.5.                  
#define CMP1MX_CMXN__CMP1N6     0x60 ///< External pin CMP1N.6.                  
#define CMP1MX_CMXN__CMP1N7     0x70 ///< External pin CMP1N.7.                  
#define CMP1MX_CMXN__CMP1N8     0x80 ///< External pin CMP1N.8.                  
#define CMP1MX_CMXN__CMP1N9     0x90 ///< External pin CMP1N.9.                  
#define CMP1MX_CMXN__CMP1N10    0xA0 ///< External pin CMP1N.10.                 
#define CMP1MX_CMXN__CS_COMPARE 0xC0 ///< Capacitive Sense Compare.              
#define CMP1MX_CMXN__VDD_DIV_2  0xD0 ///< VDD divided by 2.                      
#define CMP1MX_CMXN__LDO_OUT    0xE0 ///< Internal LDO output.                   
#define CMP1MX_CMXN__GND        0xF0 ///< Ground.                                
                                                                                 
//------------------------------------------------------------------------------
// CRC0AUTO Enums (CRC0 Automatic Control @ 0x96)
//------------------------------------------------------------------------------
#define CRC0AUTO_CRCST__FMASK     0x3F ///< Automatic CRC Calculation Starting Block  
#define CRC0AUTO_CRCST__SHIFT     0x00 ///< Automatic CRC Calculation Starting Block  
                                                                                      
#define CRC0AUTO_CRCDN__BMASK     0x40 ///< Automatic CRC Calculation Complete        
#define CRC0AUTO_CRCDN__SHIFT     0x06 ///< Automatic CRC Calculation Complete        
#define CRC0AUTO_CRCDN__NOT_SET   0x00 ///< A CRC calculation is in progress.         
#define CRC0AUTO_CRCDN__SET       0x40 ///< A CRC calculation is not in progress.     
                                                                                      
#define CRC0AUTO_AUTOEN__BMASK    0x80 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__SHIFT    0x07 ///< Automatic CRC Calculation Enable          
#define CRC0AUTO_AUTOEN__DISABLED 0x00 ///< Disable automatic CRC operations on flash.
#define CRC0AUTO_AUTOEN__ENABLED  0x80 ///< Enable automatic CRC operations on flash. 
                                                                                      
//------------------------------------------------------------------------------
// CRC0CN0 Enums (CRC0 Control 0 @ 0x92)
//------------------------------------------------------------------------------
#define CRC0CN0_CRCPNT__FMASK        0x03 ///< CRC Result Pointer                                
#define CRC0CN0_CRCPNT__SHIFT        0x00 ///< CRC Result Pointer                                
#define CRC0CN0_CRCPNT__ACCESS_B0    0x00 ///< CRC0DAT accesses bits 7-0 of the 16-bit or 32-bit 
                                          ///< CRC result.                                       
#define CRC0CN0_CRCPNT__ACCESS_B1    0x01 ///< CRC0DAT accesses bits 15-8 of the 16-bit or 32-bit
                                          ///< CRC result.                                       
#define CRC0CN0_CRCPNT__ACCESS_B2    0x02 ///< CRC0DAT accesses bits 7-0 of the 16-bit or bits   
                                          ///< 23-15 of the 32-bit CRC result.                   
#define CRC0CN0_CRCPNT__ACCESS_B3    0x03 ///< CRC0DAT accesses bits 15-8 of the 16-bit or bits  
                                          ///< 31-24 of the 32-bit CRC result.                   
                                                                                                 
#define CRC0CN0_CRCVAL__BMASK        0x04 ///< CRC Initialization Value                          
#define CRC0CN0_CRCVAL__SHIFT        0x02 ///< CRC Initialization Value                          
#define CRC0CN0_CRCVAL__SET_ZEROES   0x00 ///< CRC result is set to 0x00000000 on write of 1 to  
                                          ///< CRCINIT.                                          
#define CRC0CN0_CRCVAL__SET_ONES     0x04 ///< CRC result is set to 0xFFFFFFFF on write of 1 to  
                                          ///< CRCINIT.                                          
                                                                                                 
#define CRC0CN0_CRCINIT__BMASK       0x08 ///< CRC Initialization Enable                         
#define CRC0CN0_CRCINIT__SHIFT       0x03 ///< CRC Initialization Enable                         
#define CRC0CN0_CRCINIT__DO_NOT_INIT 0x00 ///< Do not initialize the CRC result.                 
#define CRC0CN0_CRCINIT__INIT        0x08 ///< Initialize the CRC result to ones or zeroes vased 
                                          ///< on the value of CRCVAL.                           
                                                                                                 
