ahtn/keyplus/ports/efm8/efm8/mcu/EFM8SB2/inc/SI_EFM8SB2_Register_Enums.h
#define SPI0CN0_SPIF__BMASK                   0x80 ///< SPI0 Interrupt Flag                               
#define SPI0CN0_SPIF__SHIFT                   0x07 ///< SPI0 Interrupt Flag                               
#define SPI0CN0_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last  
                                                   ///< time SPIF was cleared.                            
#define SPI0CN0_SPIF__SET                     0x80 ///< A data transfer completed.                        
                                                                                                          
//------------------------------------------------------------------------------
// SPI0DAT Enums (SPI0 Data @ 0xA3)
//------------------------------------------------------------------------------
#define SPI0DAT_SPI0DAT__FMASK 0xFF ///< SPI0 Transmit and Receive Data
#define SPI0DAT_SPI0DAT__SHIFT 0x00 ///< SPI0 Transmit and Receive Data
                                                                       
//------------------------------------------------------------------------------
// SPI1CFG Enums (SPI1 Configuration @ 0x84)
//------------------------------------------------------------------------------
#define SPI1CFG_RXBMT__BMASK                0x01 ///< Receive Buffer Empty                              
#define SPI1CFG_RXBMT__SHIFT                0x00 ///< Receive Buffer Empty                              
#define SPI1CFG_RXBMT__NOT_SET              0x00 ///< New data is available in the receive buffer (Slave
                                                 ///< mode).                                            
#define SPI1CFG_RXBMT__SET                  0x01 ///< No new data in the receive buffer (Slave mode).   
                                                                                                        
#define SPI1CFG_SRMT__BMASK                 0x02 ///< Shift Register Empty                              
#define SPI1CFG_SRMT__SHIFT                 0x01 ///< Shift Register Empty                              
#define SPI1CFG_SRMT__NOT_SET               0x00 ///< The shift register is not empty.                  
#define SPI1CFG_SRMT__SET                   0x02 ///< The shift register is empty.                      
                                                                                                        
#define SPI1CFG_NSSIN__BMASK                0x04 ///< NSS Instantaneous Pin Input                       
#define SPI1CFG_NSSIN__SHIFT                0x02 ///< NSS Instantaneous Pin Input                       
#define SPI1CFG_NSSIN__LOW                  0x00 ///< The NSS pin is low.                               
#define SPI1CFG_NSSIN__HIGH                 0x04 ///< The NSS pin is high.                              
                                                                                                        
#define SPI1CFG_SLVSEL__BMASK               0x08 ///< Slave Selected Flag                               
#define SPI1CFG_SLVSEL__SHIFT               0x03 ///< Slave Selected Flag                               
#define SPI1CFG_SLVSEL__NOT_SELECTED        0x00 ///< The Slave is not selected (NSS is high).          
#define SPI1CFG_SLVSEL__SELECTED            0x08 ///< The Slave is selected (NSS is low).               
                                                                                                        
#define SPI1CFG_CKPOL__BMASK                0x10 ///< SPI1 Clock Polarity                               
#define SPI1CFG_CKPOL__SHIFT                0x04 ///< SPI1 Clock Polarity                               
#define SPI1CFG_CKPOL__IDLE_LOW             0x00 ///< SCK line low in idle state.                       
#define SPI1CFG_CKPOL__IDLE_HIGH            0x10 ///< SCK line high in idle state.                      
                                                                                                        
#define SPI1CFG_CKPHA__BMASK                0x20 ///< SPI1 Clock Phase                                  
#define SPI1CFG_CKPHA__SHIFT                0x05 ///< SPI1 Clock Phase                                  
#define SPI1CFG_CKPHA__DATA_CENTERED_FIRST  0x00 ///< Data centered on first edge of SCK period.        
#define SPI1CFG_CKPHA__DATA_CENTERED_SECOND 0x20 ///< Data centered on second edge of SCK period.       
                                                                                                        
#define SPI1CFG_MSTEN__BMASK                0x40 ///< Master Mode Enable                                
#define SPI1CFG_MSTEN__SHIFT                0x06 ///< Master Mode Enable                                
#define SPI1CFG_MSTEN__MASTER_DISABLED      0x00 ///< Disable master mode. Operate in slave mode.       
#define SPI1CFG_MSTEN__MASTER_ENABLED       0x40 ///< Enable master mode. Operate as a master.          
                                                                                                        
#define SPI1CFG_SPIBSY__BMASK               0x80 ///< SPI Busy                                          
#define SPI1CFG_SPIBSY__SHIFT               0x07 ///< SPI Busy                                          
#define SPI1CFG_SPIBSY__NOT_SET             0x00 ///< A SPI transfer is not in progress.                
#define SPI1CFG_SPIBSY__SET                 0x80 ///< A SPI transfer is in progress.                    
                                                                                                        
//------------------------------------------------------------------------------
// SPI1CKR Enums (SPI1 Clock Rate @ 0x85)
//------------------------------------------------------------------------------
#define SPI1CKR_SPI1CKR__FMASK 0xFF ///< SPI1 Clock Rate
#define SPI1CKR_SPI1CKR__SHIFT 0x00 ///< SPI1 Clock Rate
                                                        
//------------------------------------------------------------------------------
// SPI1CN0 Enums (SPI1 Control @ 0xB0)
//------------------------------------------------------------------------------
#define SPI1CN0_SPIEN__BMASK                  0x01 ///< SPI1 Enable                                       
#define SPI1CN0_SPIEN__SHIFT                  0x00 ///< SPI1 Enable                                       
#define SPI1CN0_SPIEN__DISABLED               0x00 ///< Disable the SPI module.                           
#define SPI1CN0_SPIEN__ENABLED                0x01 ///< Enable the SPI module.                            
                                                                                                          
#define SPI1CN0_TXBMT__BMASK                  0x02 ///< Transmit Buffer Empty                             
#define SPI1CN0_TXBMT__SHIFT                  0x01 ///< Transmit Buffer Empty                             
#define SPI1CN0_TXBMT__NOT_SET                0x00 ///< The transmit buffer is not empty.                 
#define SPI1CN0_TXBMT__SET                    0x02 ///< The transmit buffer is empty.                     
                                                                                                          
#define SPI1CN0_NSSMD__FMASK                  0x0C ///< Slave Select Mode                                 
#define SPI1CN0_NSSMD__SHIFT                  0x02 ///< Slave Select Mode                                 
#define SPI1CN0_NSSMD__3_WIRE                 0x00 ///< 3-Wire Slave or 3-Wire Master Mode. NSS signal is 
                                                   ///< not routed to a port pin.                         
#define SPI1CN0_NSSMD__4_WIRE_SLAVE           0x04 ///< 4-Wire Slave or Multi-Master Mode. NSS is an input
                                                   ///< to the device.                                    
#define SPI1CN0_NSSMD__4_WIRE_MASTER_NSS_LOW  0x08 ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                   ///< logic low.                                        
#define SPI1CN0_NSSMD__4_WIRE_MASTER_NSS_HIGH 0x0C ///< 4-Wire Single-Master Mode. NSS is an output and   
                                                   ///< logic high.                                       
                                                                                                          
#define SPI1CN0_RXOVRN__BMASK                 0x10 ///< Receive Overrun Flag                              
#define SPI1CN0_RXOVRN__SHIFT                 0x04 ///< Receive Overrun Flag                              
#define SPI1CN0_RXOVRN__NOT_SET               0x00 ///< A receive overrun did not occur.                  
#define SPI1CN0_RXOVRN__SET                   0x10 ///< A receive overrun occurred.                       
                                                                                                          
