ahtn/keyplus/ports/efm8/efm8/mcu/EFM8SB2/inc/SI_EFM8SB2_Register_Enums.h
#define SPI1CN0_MODF__BMASK                   0x20 ///< Mode Fault Flag                                   
#define SPI1CN0_MODF__SHIFT                   0x05 ///< Mode Fault Flag                                   
#define SPI1CN0_MODF__NOT_SET                 0x00 ///< A master collision did not occur.                 
#define SPI1CN0_MODF__SET                     0x20 ///< A master collision occurred.                      
                                                                                                          
#define SPI1CN0_WCOL__BMASK                   0x40 ///< Write Collision Flag                              
#define SPI1CN0_WCOL__SHIFT                   0x06 ///< Write Collision Flag                              
#define SPI1CN0_WCOL__NOT_SET                 0x00 ///< A write collision did not occur.                  
#define SPI1CN0_WCOL__SET                     0x40 ///< A write collision occurred.                       
                                                                                                          
#define SPI1CN0_SPIF__BMASK                   0x80 ///< SPI1 Interrupt Flag                               
#define SPI1CN0_SPIF__SHIFT                   0x07 ///< SPI1 Interrupt Flag                               
#define SPI1CN0_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last  
                                                   ///< time SPIF was cleared.                            
#define SPI1CN0_SPIF__SET                     0x80 ///< A data transfer completed.                        
                                                                                                          
//------------------------------------------------------------------------------
// SPI1DAT Enums (SPI1 Data @ 0x86)
//------------------------------------------------------------------------------
#define SPI1DAT_SPI1DAT__FMASK 0xFF ///< SPI1 Transmit and Receive Data
#define SPI1DAT_SPI1DAT__SHIFT 0x00 ///< SPI1 Transmit and Receive Data
                                                                       
//------------------------------------------------------------------------------
// TOFFH Enums (Temperature Sensor Offset High @ 0x86)
//------------------------------------------------------------------------------
#define TOFFH_TOFF__FMASK 0xFF ///< Temperature Sensor Offset High
#define TOFFH_TOFF__SHIFT 0x00 ///< Temperature Sensor Offset High
                                                                  
//------------------------------------------------------------------------------
// TOFFL Enums (Temperature Sensor Offset Low @ 0x85)
//------------------------------------------------------------------------------
#define TOFFL_TOFF__FMASK 0xC0 ///< Temperature Sensor Offset Low
#define TOFFL_TOFF__SHIFT 0x06 ///< Temperature Sensor Offset Low
                                                                 
//------------------------------------------------------------------------------
// TH0 Enums (Timer 0 High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define TH0_TH0__FMASK 0xFF ///< Timer 0 High Byte
#define TH0_TH0__SHIFT 0x00 ///< Timer 0 High Byte
                                                  
//------------------------------------------------------------------------------
// TH1 Enums (Timer 1 High Byte @ 0x8D)
//------------------------------------------------------------------------------
#define TH1_TH1__FMASK 0xFF ///< Timer 1 High Byte
#define TH1_TH1__SHIFT 0x00 ///< Timer 1 High Byte
                                                  
//------------------------------------------------------------------------------
// TL0 Enums (Timer 0 Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define TL0_TL0__FMASK 0xFF ///< Timer 0 Low Byte
#define TL0_TL0__SHIFT 0x00 ///< Timer 0 Low Byte
                                                 
//------------------------------------------------------------------------------
// TL1 Enums (Timer 1 Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define TL1_TL1__FMASK 0xFF ///< Timer 1 Low Byte
#define TL1_TL1__SHIFT 0x00 ///< Timer 1 Low Byte
                                                 
//------------------------------------------------------------------------------
// TMR2CN0 Enums (Timer 2 Control 0 @ 0xC8)
//------------------------------------------------------------------------------
#define TMR2CN0_T2XCLK__FMASK                  0x03 ///< Timer 2 External Clock Select                     
#define TMR2CN0_T2XCLK__SHIFT                  0x00 ///< Timer 2 External Clock Select                     
#define TMR2CN0_T2XCLK__SYSCLK_DIV_12_CAP_RTC  0x00 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                    ///< RTC/8.                                            
#define TMR2CN0_T2XCLK__CMP_0_CAP_RTC          0x01 ///< External Clock is Comparator 0. Capture trigger is
                                                    ///< RTC/8.                                            
#define TMR2CN0_T2XCLK__SYSCLK_DIV_12_CAP_CMP0 0x02 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                    ///< Comparator 0.                                     
#define TMR2CN0_T2XCLK__RTC_DIV_8_CAP_CMP0     0x03 ///< External Clock is RTC/8. Capture trigger is       
                                                    ///< Comparator 0.                                     
                                                                                                           
#define TMR2CN0_TR2__BMASK                     0x04 ///< Timer 2 Run Control                               
#define TMR2CN0_TR2__SHIFT                     0x02 ///< Timer 2 Run Control                               
#define TMR2CN0_TR2__STOP                      0x00 ///< Stop Timer 2.                                     
#define TMR2CN0_TR2__RUN                       0x04 ///< Start Timer 2 running.                            
                                                                                                           
#define TMR2CN0_T2SPLIT__BMASK                 0x08 ///< Timer 2 Split Mode Enable                         
#define TMR2CN0_T2SPLIT__SHIFT                 0x03 ///< Timer 2 Split Mode Enable                         
#define TMR2CN0_T2SPLIT__16_BIT_RELOAD         0x00 ///< Timer 2 operates in 16-bit auto-reload mode.      
#define TMR2CN0_T2SPLIT__8_BIT_RELOAD          0x08 ///< Timer 2 operates as two 8-bit auto-reload timers. 
                                                                                                           
#define TMR2CN0_TF2CEN__BMASK                  0x10 ///< Timer 2 Capture Enable                            
#define TMR2CN0_TF2CEN__SHIFT                  0x04 ///< Timer 2 Capture Enable                            
#define TMR2CN0_TF2CEN__DISABLED               0x00 ///< Disable capture mode.                             
#define TMR2CN0_TF2CEN__ENABLED                0x10 ///< Enable capture mode.                              
                                                                                                           
#define TMR2CN0_TF2LEN__BMASK                  0x20 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN0_TF2LEN__SHIFT                  0x05 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN0_TF2LEN__DISABLED               0x00 ///< Disable low byte interrupts.                      
#define TMR2CN0_TF2LEN__ENABLED                0x20 ///< Enable low byte interrupts.                       
                                                                                                           
#define TMR2CN0_TF2L__BMASK                    0x40 ///< Timer 2 Low Byte Overflow Flag                    
#define TMR2CN0_TF2L__SHIFT                    0x06 ///< Timer 2 Low Byte Overflow Flag                    
#define TMR2CN0_TF2L__NOT_SET                  0x00 ///< Timer 2 low byte did not overflow.                
#define TMR2CN0_TF2L__SET                      0x40 ///< Timer 2 low byte overflowed.                      
                                                                                                           
#define TMR2CN0_TF2H__BMASK                    0x80 ///< Timer 2 High Byte Overflow Flag                   
#define TMR2CN0_TF2H__SHIFT                    0x07 ///< Timer 2 High Byte Overflow Flag                   
#define TMR2CN0_TF2H__NOT_SET                  0x00 ///< Timer 2 8-bit high byte or 16-bit value did not   
                                                    ///< overflow.                                         
#define TMR2CN0_TF2H__SET                      0x80 ///< Timer 2 8-bit high byte or 16-bit value           
                                                    ///< overflowed.                                       
                                                                                                           
//------------------------------------------------------------------------------
// TMR2H Enums (Timer 2 High Byte @ 0xCD)
//------------------------------------------------------------------------------
#define TMR2H_TMR2H__FMASK 0xFF ///< Timer 2 High Byte
#define TMR2H_TMR2H__SHIFT 0x00 ///< Timer 2 High Byte
                                                      
//------------------------------------------------------------------------------
// TMR2L Enums (Timer 2 Low Byte @ 0xCC)
//------------------------------------------------------------------------------
#define TMR2L_TMR2L__FMASK 0xFF ///< Timer 2 Low Byte
#define TMR2L_TMR2L__SHIFT 0x00 ///< Timer 2 Low Byte
                                                     
//------------------------------------------------------------------------------
// TMR2RLH Enums (Timer 2 Reload High Byte @ 0xCB)
//------------------------------------------------------------------------------
#define TMR2RLH_TMR2RLH__FMASK 0xFF ///< Timer 2 Reload High Byte
#define TMR2RLH_TMR2RLH__SHIFT 0x00 ///< Timer 2 Reload High Byte
                                                                 
//------------------------------------------------------------------------------
// TMR2RLL Enums (Timer 2 Reload Low Byte @ 0xCA)
//------------------------------------------------------------------------------
#define TMR2RLL_TMR2RLL__FMASK 0xFF ///< Timer 2 Reload Low Byte
#define TMR2RLL_TMR2RLL__SHIFT 0x00 ///< Timer 2 Reload Low Byte
                                                                
//------------------------------------------------------------------------------
// TMR3CN0 Enums (Timer 3 Control 0 @ 0x91)
//------------------------------------------------------------------------------
#define TMR3CN0_T3XCLK__FMASK                    0x03 ///< Timer 3 External Clock Select                     
#define TMR3CN0_T3XCLK__SHIFT                    0x00 ///< Timer 3 External Clock Select                     
#define TMR3CN0_T3XCLK__SYSCLK_DIV_12_CAP_CMP1   0x00 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                      ///< Comparator 1.                                     
#define TMR3CN0_T3XCLK__EXTOSC_DIV_8_CAP_CMP1    0x01 ///< External Clock is External Oscillator/8. Capture  
                                                      ///< trigger is Comparator 1.                          
#define TMR3CN0_T3XCLK__SYSCLK_DIV_12_CAP_EXTOSC 0x02 ///< External Clock is SYSCLK/12. Capture trigger is   
                                                      ///< External Oscillator/8.                            
#define TMR3CN0_T3XCLK__CMP1_CAP_EXTOSC          0x03 ///< External Clock is Comparator 1. Capture trigger is
                                                      ///< External Oscillator/8.                            
                                                                                                             
#define TMR3CN0_TR3__BMASK                       0x04 ///< Timer 3 Run Control                               
#define TMR3CN0_TR3__SHIFT                       0x02 ///< Timer 3 Run Control                               
#define TMR3CN0_TR3__STOP                        0x00 ///< Stop Timer 3.                                     
#define TMR3CN0_TR3__RUN                         0x04 ///< Start Timer 3 running.                            
                                                                                                             
#define TMR3CN0_T3SPLIT__BMASK                   0x08 ///< Timer 3 Split Mode Enable                         
#define TMR3CN0_T3SPLIT__SHIFT                   0x03 ///< Timer 3 Split Mode Enable                         
#define TMR3CN0_T3SPLIT__16_BIT_RELOAD           0x00 ///< Timer 3 operates in 16-bit auto-reload mode.      
#define TMR3CN0_T3SPLIT__8_BIT_RELOAD            0x08 ///< Timer 3 operates as two 8-bit auto-reload timers. 
                                                                                                             
#define TMR3CN0_TF3CEN__BMASK                    0x10 ///< Timer 3 Capture Enable                            
#define TMR3CN0_TF3CEN__SHIFT                    0x04 ///< Timer 3 Capture Enable                            
#define TMR3CN0_TF3CEN__DISABLED                 0x00 ///< Disable capture mode.                             
#define TMR3CN0_TF3CEN__ENABLED                  0x10 ///< Enable capture mode.                              
                                                                                                             
